wsdl/inbound/SendMobData.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions name="MobileDataManager" targetNamespace="http://www.iss.com/wsdl/services/mobility/mobility/v1" xmlns:jobmessage="http://www.iss.com/operationalservices/external/sendmobdata/jobmessage/v1" xmlns:tsmessage="http://www.iss.com/operationalservices/external/sendmobdata/tsmessage/v1" xmlns:soapbind="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="http://www.iss.com/wsdl/services/mobility/mobility/v1" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<wsdl:documentation>Version 1.0</wsdl:documentation>
	<wsdl:types>
		<xsd:schema elementFormDefault="qualified" targetNamespace="http://www.iss.com/wsdl/services/mobility/mobility/v1" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
 			<xsd:import namespace="http://www.iss.com/operationalservices/external/sendmobdata/tsmessage/v1" schemaLocation="./wsdl/inbound/Timesheet.xsd"/>
			<xsd:import namespace="http://www.iss.com/operationalservices/external/sendmobdata/jobmessage/v1" schemaLocation="./wsdl/inbound/SendMobData.xsd"/>
		</xsd:schema>
	</wsdl:types>
	<wsdl:message name="SendJob">
		<wsdl:part element="jobmessage:SendJob" name="SendJob"/>
	</wsdl:message>
	<wsdl:message name="JobId">
		<wsdl:part element="jobmessage:JobId" name="JobId"/>
	</wsdl:message>
	<wsdl:message name="SendTimesheet">
		<wsdl:part element="tsmessage:SendTimesheet" name="SendTimesheet"/>
	</wsdl:message>
	<wsdl:message name="TimesheetId">
		<wsdl:part element="tsmessage:TimesheetId" name="TimesheetId"/>
	</wsdl:message>
	<wsdl:portType name="MobileDataManager">
		<wsdl:operation name="SendJob">
			<wsdl:input message="tns:SendJob"/>
			<wsdl:output message="tns:JobId"/>
		</wsdl:operation>
		<wsdl:operation name="SendTimesheet">
			<wsdl:input message="tns:SendTimesheet"/>
			<wsdl:output message="tns:TimesheetId"/>
		</wsdl:operation>
	</wsdl:portType>
	<wsdl:binding name="MobileDataManagerPort" type="tns:MobileDataManager">
		<soapbind:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="SendTimesheet">
			<soapbind:operation soapAction="http://www.iss.com/wsdl/services/mobility/mobility"/>
			<wsdl:input>
				<soapbind:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soapbind:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="SendJob">
			<soapbind:operation soapAction="http://www.iss.com/wsdl/services/mobility/mobility"/>
			<wsdl:input>
				<soapbind:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soapbind:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
	<wsdl:service name="MobileDataManager">
		<wsdl:port name="MobileDataManagerPort" binding="tns:MobileDataManagerPort">
			<soapbind:address location="https://iss-iorgmauj6xvrcvvef5nhkhis-dev.mbaas1.eu.feedhenry.com/ws/MobileDataManager"/>
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions>
