scripts/soapRequests/updateJob1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://www.iss.com/operationalservices/external/sendmobdata/jobmessage/v1">
   <soapenv:Header/>
   <soapenv:Body>
      <v1:SendJob>
         <v1:UniqueRef>11498455-6647</v1:UniqueRef>
         <v1:LabourCode>6647</v1:LabourCode>
         <v1:JobNo>11498453</v1:JobNo>
         <v1:Sort>2015/02/15 00:00:00</v1:Sort>
         <v1:Colour>BLUE</v1:Colour>
         <v1:Priority/>
         <v1:JobDate>2015-02-15</v1:JobDate>
         <v1:JobTime>00:00:00.0000000+01:00</v1:JobTime>
         <v1:Address1>58 HIGH STREET</v1:Address1>
         <v1:Address2>58 HIGH STREET</v1:Address2>
         <v1:Town>BRADFORD</v1:Town>
         <v1:County>Yorks</v1:County>
         <v1:Postcode>BD13 2QL</v1:Postcode>
         <v1:Client>NAG YORKSHIRE BANK</v1:Client>
         <v1:Contact/>
         <v1:Phone1/>
         <v1:Phone2/>
         <v1:Access/>
         <v1:JobType>PM - Monthly</v1:JobType>
         <v1:JobDescription>New Job Description</v1:JobDescription>
         <v1:JobDetails>New Job Details</v1:JobDetails>
         <v1:ClientRef/>
         <v1:ScheduledStartDate>0001-01-01</v1:ScheduledStartDate>
         <v1:ScheduledStartTime>00:00:00.0000000+01:00</v1:ScheduledStartTime>
         <v1:ContractID>11322</v1:ContractID>
         <v1:LocationID>113227</v1:LocationID>
         <v1:LocationName>YORKSHIRE BANK - QUEENSBURY 58 HIGH STREET</v1:LocationName>
         <v1:ClientLocationID/>
         <v1:TargetStartDate>2015-02-15</v1:TargetStartDate>
         <v1:TargetStartTime>00:00:00.0000000+01:00</v1:TargetStartTime>
         <v1:WOStatus>APPR</v1:WOStatus>
         <v1:WOEquipmentNo>909512</v1:WOEquipmentNo>
         <v1:ActionType>UPDATE</v1:ActionType>
         <v1:System>MAX6TEST</v1:System>
         <v1:AssetReference/>
         <v1:AssetLocation/>
         <v1:PlanCode>AHVAC35301M</v1:PlanCode>
         <v1:PlanDesc>PM - NAG - MONTHLY MMU MAINTENANCE</v1:PlanDesc>
         <v1:PlanInst>PM SCOPE OF WORKS

1 COMPLETE GSH RISK ASSESSMENT
2 CHECK ASBESTOS REGISTER BEFORE CARRYING OUT ANY MAINTENANCE
3 CARRY OUT MONTHLY MMU MAINTENANCE AS PER THE NAG MMU SCOPE OF WORKS
4 TAKE ALL METER READINGS ELEC / GAS / WATER AND SEND THROUGH TO FAXMAIL 01782 408420</v1:PlanInst>
         <v1:TargetEndDate>2015-02-15</v1:TargetEndDate>
         <v1:TargetEndTime>02:00:00.0000000+01:00</v1:TargetEndTime>
         <v1:TargetStartDateSort>999</v1:TargetStartDateSort>
         <v1:TargetEndDateSort>999</v1:TargetEndDateSort>
         <v1:Task360>1</v1:Task360>
         <v1:NoRiskAssRqd>1</v1:NoRiskAssRqd>
         <v1:EstDurRqd>0</v1:EstDurRqd>
         <v1:FailureCodeRqd>0</v1:FailureCodeRqd>
         <v1:TaskNo>11498455</v1:TaskNo>
         <v1:TaskDescription>PM - MONTHLY METER READINGS - SEE LONG DESCRIPTION</v1:TaskDescription>
         <v1:TaskDescriptionLong>Carry out Gas/Water and Electric Meter Readings and Update the Meter Reading Screen in the Extra Info Box on the Job Screen</v1:TaskDescriptionLong>
         <v1:CertReqInd>0</v1:CertReqInd>
         <v1:AccessPermit/>
      </v1:SendJob>
   </soapenv:Body>
</soapenv:Envelope>